Revit 2027 API
RebarBarType.SetLapLength Method
 Sets the lap length for the specified Rebar Splice Type.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLapLength(
	ElementId rebarSpliceTypeId,
	double lapLength
)
Public Sub SetLapLength (
	rebarSpliceTypeId As ElementId,
	lapLength As Double
)
public:
void SetLapLength(
	ElementId^ rebarSpliceTypeId,
	double lapLength
)
member SetLapLength :
        rebarSpliceTypeId : ElementId *
        lapLength : float -> unit
Parameters
rebarSpliceTypeId ElementId
 The Rebar Splice Type id. Interactions with Rebar Splice Types can be done with the functions in RebarSpliceTypeUtils.
lapLength Double
 The new value of the lap length.
Exceptions
Exception | Condition
ArgumentException |  The rebarSpliceTypeId doesn't represent a valid Rebar Splice Type. It should be an ElementType of BuiltInCategory.OST_RebarSpliceType category. -or- For the specified Rebar Splice Type the lap length is auto calculated and the lap length cannot be manually set. Its value is computed based on the formula splice type: lap length multiplier * bar nominal diameter.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The given value for lapLength must be non-negative.
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace